#задается рандомное число от 0-16
rnd_number = rand(0..16)
#создаем счетчик попыток игрока равный 0
a = 0

puts"Загадано число от 0 до 16, отгадайте какое?"
#цикл, который дает 3 попытки, чтобы угадать число
while a < 3 do
  answer = gets.to_i
  # Введено верное число
  if (answer - rnd_number) == 0
    puts "Ура, вы выиграли!"
    exit
  else
    # Подсказки для игрока
    #.abs - модуль числа
    # Тепло - число на 2 больше или меньше искомого числа
    if ((answer - rnd_number).abs <= 2) && (answer < rnd_number)
      puts"Тепло (нужно больше)"
    elsif ((answer - rnd_number).abs <= 2) && (answer > rnd_number)
      puts "Тепло (нужно меньше)"
      #Холодно - введенное число отличается от искомого более чем на 2
    elsif (answer - rnd_number).abs >=3
      puts "Холодно"
    end
  end
  #счетчик попыток
  a += 1
end
#Если все 3 попытки не увенчались успехом
puts "В этот раз вам не повезло. Было загадано число #{rnd_number}"
